oneteam/oneteam/backend/models/Pub.php

INSERT INTO `we_pub` (`p_name`, `appid`, `appsecret`, `w_num`, `w_numone`, `token`, `address`, `p_rand`, `u_id`) VALUES ('q', 'q', 'q', 'q', 'q', '620b8b5f72bc3ba1', 'http://www.1408phpe.com/oneteam/backend/web/account/res/c9TYXDln.html', 'c9TYXDln', 1)
---
    function add_do($array){
        $key = $this->key;//私钥
        $mydes = new Des();//实例化des类
        $data = $array['account'];//要加密的数据----生成token
        $desdata = $mydes->des($data,$key);//加密为二进制数据
        //加密后的数据
        $encode_data = $mydes->asc2hex($desdata);//二进制转16进制
        $p_rand=$this->randpw(8,'ALL');
        $url=Url::toRoute(['account/res','do'=>$p_rand],true);
        $arr=array(
            'p_name'=>isset($array['name'])?$array['name']:'',
            'appid'=>isset($array['key'])?$array['key']:'',
            'appsecret'=>isset($array['secret'])?$array['secret']:'',
            'w_num'=>isset($array['account'])?$array['account']:'',
            'w_numone'=>isset($array['original'])?$array['original']:'',
            'token'=>$encode_data,
            'address'=>$url,
            'p_rand'=>$p_rand,
            'u_id'=>Yii::$app->session['uid']
        );
        $db=Yii::$app->db;
        if($db->createCommand()->insert($this->tableName(),$arr)->execute()){