oneteam/oneteam/backend/models/Rule.php

    function r_add($data){
        $rk=explode(',',$data['keywords']);
        $db=Yii::$app->db;
        foreach($rk as $v){
            if($v!=''){
                $arr=array(
                    'r_name'=>$data['name'],
                    'r_type'=>$data['id'],
                    'r_key'=>$v,
                    'r_content'=>$data['content'],
                    'p_id'=>Yii::$app->session['p_id'],
                    'uid'=>Yii::$app->session['uid'],
                );
                $db->createCommand()->insert($this->tableName(),$arr)->execute();
---
INSERT INTO `we_rule` (`r_name`, `r_type`, `r_key`, `r_content`, `p_id`, `uid`) VALUES ('åŽ\»', '1', 'åŽ\»', 'åŽ\»', 3, 1)