oneteam/oneteam/backend/models/User.php

    function sel_all($data){
        $name=$data['name'];
        $pwd=md5($data['pwd']);
        $code=isset($data['code'])?$data['code']:'';
        if($code!=Yii::$app->session['code'] && isset(Yii::$app->session['error'])){
            return 'a';
        }
        $db=Yii::$app->db;
        $sql = "SELECT * FROM ".$this->tableName()." WHERE user_name='$name' or user_tel='$name' or user_email='$name'";
        $arr=$db->createCommand($sql)->queryOne();
        if(!empty($arr)){
            if($arr['user_time']!=date('Y-m-d',time())){
                $db->createCommand()->update($this->tableName(), ['user_status' => 0,'user_time'=>date('Y-m-d',time())], 'user_id ='.$arr['user_id'])->execute();
                $arr['user_status']=0;
            }
            if($arr['user_status']>=3){
                return 'b';
            }else if($arr['user_pwd']==$pwd){
                Yii::$app->session['uid']=$arr['user_id'];
                Yii::$app->session['uname']=$arr['user_name'];
                if(isset(Yii::$app->session['error'])){
                    unset(Yii::$app->session['error']);
                }
                $db->createCommand()->update($this->tableName(), ['user_status' => 0], 'user_id ='.$arr['user_id'])->execute();
---
UPDATE `we_user` SET `user_status`=0 WHERE user_id =1